<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple/DTD PLIST 1.0//EN" "http://apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Attribution</key>
	<dict>
		<key>Copyright</key>
		<array>
			<string>SRG SSR</string>
		</array>	
		<key>Authors</key>
		<dict>
			<key>Name</key>
			<array>
				<string>Antti Pettinen</string>
			</array>
			<key>Email</key>
			<array>
				<string>a.pettinen at gmail.com</string>
			</array>
			<key>Github</key>
			<array>
				<string>apettinen</string>
			</array>
			<key>Comment</key>
			<string>This recipe uses a custom provider, RSMBDownloadURLProvider.py</string> 
		</dict>
	</dict>
  <key>Description</key>
  <string>Downloads the latest version of ReelSmartMotion Blur plugin updater and unarchives it to verify codesignature. Downloaded zip is preserved as is.</string>
  <key>Identifier</key>
  <string>com.github.srgssr.download.ReelSmartMotionBlurUpdater</string>
  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>AE_ReelSmartMotionBlurUpdater</string>
  </dict>
  <key>MinimumVersion</key>
  <string>0.6.0</string>
  <key>Process</key>
  <array>
		<dict>
			<key>Processor</key>
			<string>RSMBUpdaterDownloadURLProvider</string>
		</dict>
    <dict>
      <key>Processor</key>
      <string>URLDownloader</string>
    </dict>
    <dict>
      <key>Processor</key>
      <string>EndOfCheckPhase</string>
    </dict>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unarchived/</string>
				<key>purge_destination</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/unarchived/RSMB6AENoLicenseInstaller.app</string>
				<key>requirement</key>
				<string>identifier "com.revisioneffects.RSMB6AEappinstaller" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = JC43EKREZ6</string>
				<key>deep_verification</key>
				<true/>
			</dict>
		</dict>
  </array>
</dict> 
</plist>
