<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Velociraptor from GitHub releases.</string>
    <key>Identifier</key>
    <string>com.github.srgssr.download.velociraptor</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Velociraptor</string>
        <key>GITHUB_REPO</key>
        <string>Velocidex/velociraptor</string>
        <key>ASSET_REGEX</key>
        <string>velociraptor-.*?-darwin-arm64</string>
        <key>VERSION_REGEX</key>
        <string>v(\d+\.\d+\.\d+)</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>github_repo</key>
                <string>%GITHUB_REPO%</string>
                <key>asset_regex</key>
                <string>%ASSET_REGEX%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
            <key>Arguments</key>
            <dict/>
        </dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%</string>
				<key>deep_verification</key>
				<true/>
				<key>strict_verification</key>
				<true/>
				<key>requirement</key>
				<string>identifier "com.velocidex.velociraptor" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = UL6CGN7MAL</string>
			</dict>
		</dict>
    </array>
</dict>
</plist>