<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Velociraptor and creates a package that installs to /usr/local/velociraptor/</string>
    <key>Identifier</key>
    <string>com.github.srgssr.pkg.velociraptor</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Velociraptor</string>
        <key>VERSION_REGEX</key>
        <string>v(\d+\.\d+\.\d+)</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.srgssr.download.velociraptor</string>
    <key>Process</key>
    <array>
        <!-- Step 1: Create the necessary folder structure -->
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                <key>pkgdirs</key>
                <dict>
                    <key>usr</key>
                    <string>0755</string>
                    <key>usr/local</key>
                    <string>0755</string>
                    <key>usr/local/velociraptor</key>
                    <string>0755</string>
                </dict>
            </dict>
        </dict>

        <!-- Step 2: Copy the Velociraptor binary -->
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot/usr/local/velociraptor/velociraptor</string>
                <key>overwrite</key>
                <true/>
            </dict>
        </dict>

        <!-- Step 3: Make Velociraptor executable -->
        <dict>
            <key>Processor</key>
            <string>com.github.jessepeterson.munki.PortfolioClient10/ModeChanger</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot/usr/local/velociraptor/velociraptor</string>
                <key>mode</key>
                <string>755</string>
            </dict>
        </dict>

        <!-- Step 4: get version from %pathname% -->
        <dict>
            <key>Processor</key>
            <string>com.github.jazzace.processors/TextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>%VERSION_REGEX%</string>
                <key>text_in</key>
                <string>%pathname%</string>
                <key>result_output_var_name</key>
                <string>version</string>
            </dict>
        </dict>

        <!-- Step 5: Build the .pkg -->
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgname</key>
                    <string>%NAME%-%version%</string>
                    <key>version</key>
                    <string>%version%</string>
                    <key>id</key>
                    <string>com.velocidex.velociraptor</string>
                    <key>pkgdir</key>
                    <string>%RECIPE_CACHE_DIR%</string>
                    <key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                </dict>
            </dict>
        </dict>

        <!-- Step 6: Clean-up what we no longer need to save space. -->
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>		
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
				    <string>%RECIPE_CACHE_DIR%/pkgroot</string>
				</array>
			</dict>		
		</dict>	
    </array>
</dict>
</plist>