<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Tentacle Sync Studio.</string>
	<key>Identifier</key>
	<string>com.github.srgssr.download.TentacleSyncStudio</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>TentacleSyncStudio</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>https://tentaclesync.com/downloads/tentacle-sync-studio-macos</string>
					<key>re_pattern</key>
					<string>(ttsyncstudio-v\d+_\d+\.dmg)</string>
					<key>result_output_var_name</key>
					<string>url</string>
				</dict>
			</dict>
			<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>https://cms.tentaclesync.com/assets/%url%</string>
					<key>filename</key>
					<string>%NAME%.dmg</string>
				</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Tentacle Sync Studio.app</string>
				<key>requirement</key>
				<string>anchor apple generic and identifier "com.tentaclesync.Tentacle-Sync-Studio" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = N3J7Y6A64Z)</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/Tentacle Sync Studio.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>