<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Tentacle Float Converter.</string>
	<key>Identifier</key>
	<string>com.github.srgssr.download.TentacleFloatConverter</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>TentacleFloatConverter</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>https://tentaclesync.com/downloads/tentacle-float-converter-macos</string>
					<key>re_pattern</key>
					<string>(ttfloatconverter-v\d+_\d+_build\d+\.dmg)</string>
					<key>result_output_var_name</key>
					<string>url</string>
				</dict>
			</dict>
			<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>https://cms.tentaclesync.com/assets/downloads/download-files/%url%</string>
					<key>filename</key>
					<string>%NAME%.dmg</string>
				</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/TentacleFloatConverter.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>