<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created Jens Junge</string>
	<key>Description</key>
	<string>Imports the latest version of ZoomISO into Munki.</string>
	<key>Identifier</key>
	<string>com.github.srgssr.munki.ZoomISO</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>ZoomISO</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>ZoomISO is Zooms official, high-end offering for remote contribution, dramatically expanding the capabilities of the Zoom platform in the world of event and broadcast production. This macOS application supports a variety of output formats for popular production systems, and can export HD video in supported Zoom calls.</string>
			<key>developer</key>
            <string>Liminal</string>
			<key>display_name</key>
			<string>ZoomISO</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.srgssr.download.ZoomISO</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%found_filename%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/zip</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
