<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.5 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Native Access and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.srgssr.munki.NativeAccess</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>Native Access</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string> </string>
			<key>developer</key>
			<string>Native Instruments GmbH</string>
			<key>display_name</key>
			<string>Native Access</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
				<key>postinstall_script</key>
					<string>#!/bin/sh
				/bin/cp /Applications/Native\ Access.app/Contents/Library/LaunchServices/com.native-instruments.NativeAccess.Helper2 /Library/PrivilegedHelperTools</string>
					<key>preinstall_script</key>
					<string>#!/bin/sh
				/bin/cat &lt;&lt;EOF &gt; "/Library/LaunchDaemons/com.native-instruments.NativeAccess.Helper2.plist"
				&lt;?xml version="1.0" encoding="UTF-8"?&gt;
				&lt;!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd"&gt;
				&lt;plist version="1.0"&gt;
				&lt;dict&gt;
					&lt;key&gt;Label&lt;/key&gt;
					&lt;string&gt;com.native-instruments.NativeAccess.Helper2&lt;/string&gt;
					&lt;key&gt;MachServices&lt;/key&gt;
					&lt;dict&gt;
						&lt;key&gt;com.native-instruments.NativeAccess.Helper2&lt;/key&gt;
						&lt;true/&gt;
					&lt;/dict&gt;
					&lt;key&gt;Program&lt;/key&gt;
					&lt;string&gt;/Library/PrivilegedHelperTools/com.native-instruments.NativeAccess.Helper2&lt;/string&gt;
					&lt;key&gt;ProgramArguments&lt;/key&gt;
					&lt;array&gt;
						&lt;string&gt;/Library/PrivilegedHelperTools/com.native-instruments.NativeAccess.Helper2&lt;/string&gt;
					&lt;/array&gt;
				&lt;/dict&gt;
				&lt;/plist&gt;
				EOF</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.srgssr.download.NativeAccess</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>version_comparison_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
