<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>This recipe downloads and imports the latest version of OffShoot and imports into Munki</string>
    <key>Identifier</key>
    <string>ch.srgssr.recipes.munki.OffShoot</string>
    <key>Input</key>
    <dict>
		<key>MUNKI_CATEGORY</key>
		<string>Productivity</string>
        <key>NAME</key>
        <string>OffShoot</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>pkginfo</key>
        <dict>
        	<key>blocking_applications</key>
            <array>
                <string>%NAME%</string>
            </array>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
            <key>description</key>
            <string>Multiple backups of your media, fast and easy.</string>
            <key>display_name</key>
            <string>%NAME%</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <false/>
            <key>unattended_uninstall</key>
            <false/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>ch.srgssr.recipes.download.OffShoot</string>
    <key>Process</key>
    <array>
     	<dict>
    		<key>Processor</key>
    		<string>MunkiInstallsItemsCreator</string>
    		<key>Arguments</key>
    		<dict>
    			<key>faux_root</key>
    			<string>%pkgroot%</string>
    			<key>installs_item_paths</key>
    			<array>
	    			<string>/Applications/%NAME%.app</string>
				</array>
    		</dict>
    	</dict>
    	<dict>
    		<key>Processor</key>
    		<string>MunkiPkginfoMerger</string>
    	</dict>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
        <dict>
        	<key>Processor</key>
        	<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
       	    	<key>path_list</key>
            	<array>
                	<string>%RECIPE_CACHE_DIR%/temp</string>
                	<string>%RECIPE_CACHE_DIR%/unpack</string>
            	</array>
        	</dict>
		</dict>
    </array>
</dict>
</plist>