<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Create Installer package with OffShoot installer packege inside a temporary folder.</string>
    <key>Identifier</key>
    <string>ch.srgssr.recipes.pkg.OffShoot</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>OffShoot</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>ParentRecipe</key>
    <string>ch.srgssr.recipes.download.OffShoot</string>
    <key>Process</key>
    <array>

		<dict>
 			<key>Comment</key>
			<string>Extract Version information from OffShoot.app.</string>
			<key>Processor</key>
			<string>Versioner</string>		
			<key>Arguments</key>
			<dict>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
				<key>input_plist_path</key>
				<string>%pkgroot%/Applications/%NAME%.app/Contents/Info.plist</string>
			</dict>
		</dict>
        <dict>
 			<key>Comment</key>
			<string>Create temporary folder.</string>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgdirs</key>
                <dict>
                    <key>private</key>
                    <string>755</string>
                    <key>private/var</key>
                    <string>755</string>
                    <key>private/var/tmp</key>
                    <string>1777</string>
                </dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot</string>
            </dict>
        </dict>
		<dict>
			<key>Comment</key>
			<string>Copy PKG inside downloaded DMG into temporary folder.</string>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%pathname%/OffShoot Installer.pkg</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot/private/var/tmp/OffShoot Installer.pkg</string>
            </dict>
        </dict>
		<dict>
			<key>Comment</key>
			<string>Create the installer package containing the pkg in temporary folder.</string>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
					<key>pkgdir</key>
					<string>%RECIPE_CACHE_DIR%</string>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>id</key>
					<string>ch.srgssr.pkg.%NAME%</string>
					<key>version</key>
					<string>%version%</string>
					<key>options</key>
					<string>purge_ds_store</string>
				</dict>
			</dict>
		</dict>
        <dict>
			<key>Comment</key>
			<string>Delete everything we no longer need in order to save space.</string>
        	<key>Processor</key>
        	<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
       	    	<key>path_list</key>
            	<array>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
            	</array>
        	</dict>
		</dict>

    </array>
</dict>
</plist>