<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of MapTiler Engine</string>
	<key>Identifier</key>
	<string>com.github.srgssr.download.MapTilerEngine</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>MapTiler Engine</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<!-- find version number to bypass email-popup -->
		<dict>
			<key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.maptiler.com/engine/download/</string>
                <key>re_pattern</key>
                <string>\bVersion.+[^0-9.](\d+\.\d+)&lt;</string>
				<key>result_output_var_name</key>
		        <string>downloadversion</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://maptiler.download/engine/maptiler-engine-%downloadversion%-app-mac.dmg</string>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
		</dict>

	<dict>
		<key>Processor</key>
		<string>EndOfCheckPhase</string>
	</dict>
</array>
</dict>
</plist>