<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of MapTiler Engine</string>
	<key>Identifier</key>
	<string>com.github.srgssr.recipes.download.MapTilerEngine</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>MapTiler Engine</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.maptiler.com/engine/download/</string>
                <key>re_pattern</key>
                <string>(https:\/\/maptiler\.download\/engine\/maptiler-engine-(\d+\.\d+)-app-mac\.dmg)</string>
				<key>result_output_var_name</key>
		        <string>url</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%url%</string>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
		</dict>

	<dict>
		<key>Processor</key>
		<string>EndOfCheckPhase</string>
	</dict>
	<dict>
		<key>Arguments</key>
		<dict>
			<key>expected_authority_names</key>
			<array>
				<string>Klokan Technologies GmbH (KBDAWM7T4E)</string>
				<string>Developer ID Certification Authority</string>
				<string>Apple Root CA</string>
			</array>
			<key>input_path</key>
			<string>%pathname%</string>
		</dict>
		<key>Processor</key>
		<string>CodeSignatureVerifier</string>
	</dict>
</array>
</dict>
</plist>