<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.5 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Phocus.</string>
	<key>Identifier</key>
	<string>com.github.srgssr.download.Phocus</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>https://www.hasselblad.com/my-hasselblad/#/downloads?product=133</string>
		<key>NAME</key>
		<string>Phocus</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>https://www.hasselblad.com/my-hasselblad/#/downloads?product=133</string>
					<key>re_pattern</key>
					<string>(/20[0-9\.]+/[0-9\.]+/Phocus-[0-9\.]+).dmg</string>
					<key>result_output_var_name</key>
					<string>url</string>
				</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>http://static.hasselblad.com/%url%.dmg</string>
					<key>filename</key>
					<string>%NAME%.dmg</string>
				</dict>	
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Phocus.app</string>
				<key>requirement</key>
				<string>anchor apple generic and identifier "dk.hasselblad.phocus" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "56UFF38UTM")</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/Phocus.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
