<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.5 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Phocus and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.srgssr.munki.Phocus</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>SW/Hasselblad/Phocus</string>
		<key>NAME</key>
		<string>Phocus</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>QA</string>
			</array>
			<key>description</key>
			<string>asselblad is the leading manufacturer of digital medium format cameras and lenses. Hasselblad cameras are renowned for their iconic design, uncompromising image quality, and high performance.</string>
			<key>developer</key>
			<string>Hasselblad</string>
			<key>display_name</key>
			<string>Phocus</string>
			<key>name</key>
			<string>SW_%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.srgssr.download.Phocus</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
