<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created by Jens Junge 2021-06-29</string>
	<key>Description</key>
	<string>Downloads the latest version of MediaInfo CLI and imports it into Munki.</string>
	<key>Identifier</key>
	<string>ch.srgssr.pkg.munki.MediaInfoCLI</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>MediaArea/MediaInfo</string>
		<key>NAME</key>
		<string>MediaInfo</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>MediaInfo provides you with a quick access to the inner values of your audio and video files. Whether you want to glance at the set-up of tracks included in a file or you want to know all the precise details about the codecs used, MediaInfo will offer the suitable view.</string>
			<key>developer</key>
			<string>MediaArea</string>
			<key>display_name</key>
			<string>MediaInfo</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>ch.srgssr.pkg.download.MediaInfoCLI</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
