<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of VideoCopilot ORB</string>
	<key>Identifier</key>
	<string>com.github.srgssr.download.VideoCopilotORB</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>VideocopilotOrb</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.videocopilot.net/orb/</string>
                <key>re_pattern</key>
                <string>(https://www.videocopilot.net/dl/mFABJFXa5om/)</string>
		        <key>result_output_var_name</key>
		        <string>url</string>
        	</dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.zip</string>
				<key>url</key>
				<string>%url%</string>
			</dict>
		</dict>
		<dict>
      		<key>Processor</key>
      		<string>Unarchiver</string>
      		<key>Arguments</key>
			<dict>
				<key>purge_destination</key>
				<true/>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/zip</string>
			</dict>
		</dict>
		<!-- filefinder not needed as filenames are static with version changes
		<dict>
			<key>Comment</key>
        	<string>get the name of the unzipped pkg</string>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%RECIPE_CACHE_DIR%/zip/*.dmg</string>
            </dict>
		</dict>
		-->
		<dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/zip/VCOrbInstaller.dmg/VCOrbInstaller.app/Contents/Resources/VCOrb.plugin</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/VCOrb.plugin</string>
            </dict>
		</dict>

		<!-- Verify Code signature of the plugin -->
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/VCOrb.plugin</string>
				<key>deep_verification</key>
				<true/>
				<key>strict_verification</key>
				<true/>
				<key>requirement</key>
				<string>identifier "net.videocopilot.VCOrb" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "462FK78NZ8"</string>
			</dict>
		</dict>

		<!-- cleanup -->
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/zip</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
