<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Attribution</key>
		<dict>
			<key>Copyright</key>
			<array>
				<string>SRGSSR</string>
			</array>
			<key>Authors</key>
			<dict>
				<key>Name</key>
				<array>
					<string>Antti Pettinen</string>
				</array>
				<key>Email</key>
				<array>
					<string>a.pettinen at apfelwerk.de</string>
				</array>
				<key>Github</key>
				<array>
					<string>apettinen</string>
				</array>
			</dict>
		</dict>
		<key>Description</key>
		<string>Downloads the latest version of AJA Kona 3g driver and imports it into munki</string>
		<key>Identifier</key>
		<string>com.github.srgssr.munki.AJAKona3gDriver</string>
		<key>Input</key>
		<dict>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>Kona3gDriver</string>
			<key>PATTERN</key>
			<string>AJA_Mac_Retail_*_*_*.pkg</string> 
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>category</key>
				<string>Driver</string>
				<key>description</key>
				<string>This installer includes all AJA hardware drivers, AJA Control Room and plug-ins for Adobe, Avid and Wirecast in a single, unified package for KONA, Io and T-TAP products.</string>
				<key>developer</key>
				<string>AJA</string>
				<key>display_name</key>
				<string>AJA Kona 3g Driver</string>
				<key>name</key>
				<string>AJA_Kona3g</string>
				<key>unattended_install</key>
				<true/>
				<key>RestartAction</key>
				<string>RequireRestart</string>
			</dict>
		</dict>
		<key>MinimumVersion</key>
		<string>0.6.0</string>
		<key>ParentRecipe</key>
		<string>com.github.srgssr.download.AJAKona3gDriver</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>FileFinder</string>
				<key>Arguments</key>
				<dict>
					<key>pattern</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%/%PATTERN%</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>FileMover</string>
				<key>Arguments</key>
				<dict>
					<key>source</key>
					<string>%found_filename%</string>
					<key>target</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PathDeleter</string>
				<key>Arguments</key>
				<dict>
					<key>path_list</key>
					<array>
					<string>%RECIPE_CACHE_DIR%/%NAME%/</string>
					</array>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
