<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.5 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of MediaInfo.</string>
	<key>Identifier</key>
	<string>ch.srgssr.pkg.download.MediaInfo</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>https://mediaarea.net/en/MediaInfo/Download/Mac_OS</string>
		<key>NAME</key>
		<string>MediaInfo</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.5</string>
<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>https://mediaarea.net/en/MediaInfo/Download/Mac_OS</string>
					<key>re_pattern</key>
					<string>(/[0-9\.]+/MediaInfo_GUI_[0-9\.]+_Mac.dmg)</string>
					<key>result_output_var_name</key>
					<string>url</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>https://mediaarea.net/en/MediaInfo/Download/Mac_OS/%url%</string>
					<key>filename</key>
					<string>%NAME%.dmg</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
		</array>
</dict>
</plist>
