<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created by SRF - Jens Junge</string>
	<key>Description</key>
	<string>Downloads the latest version of Hype4.</string>
	<key>Identifier</key>
	<string>com.github.srgssr.download.Hype4</string>
	<key>Input</key>
	<dict>
		
		<key>NAME</key>
		<string>Hype4</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://static.tumult.com/hype/download/Hype.dmg</string>
				<key>filename</key>
				<string>%NAME%.dmg</string>
		
			</dict>	
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Hype4.app</string>
				<key>requirement</key>
				<string>anchor apple generic and identifier "com.tumult.Hype4" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "8J356DM772")</string>
				<key>deep_verification</key>
				<true/>
				<key>strict_verification</key>
				<true/>
			</dict>
		</dict>
	</array>
</dict>
</plist>
