<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string> </string>
	<key>Description</key>
	<string>Downloads the latest version of Hype3 and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.srgssr.munki.Hype3</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>Hype3</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Create beautiful HTML5 web content. Interactive web content and animations made with Tumult Hype work on desktops, smartphones and iPads. No coding required.</string>
			<key>developer</key>
			<string>Tumult</string>
			<key>display_name</key>
			<string>Hype 3</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.srgssr.download.Hype3</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.srgssr.download.Hype3</key>
			<dict>
				<key>git_hash</key>
				<string>527f1c0dc981a4a72127bbaa0fc39c95b7859f6c</string>
				<key>path</key>
				<string>~/GITHub/recipes/Hype3/Hype3.download.recipe</string>
				<key>sha256_hash</key>
				<string>ce62eab34129daab9158716430e6eef3a3015120be276370655267d747d57895</string>
			</dict>
		</dict>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
