<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
		<key>Attribution</key>
		<dict>
			<key>Copyright</key>
			<array>
				<string>SRG SSR</string>
			</array>
			<key>Authors</key>
			<dict>
				<key>Name</key>
				<array>
					<string>Antti Pettinen</string>
				</array>
				<key>Email</key>
				<array>
					<string>a.pettinen at gmail.com</string>
				</array>
				<key>Github</key>
				<array>
					<string>apettinen</string>
				</array>
			</dict>
		</dict>
    <key>Description</key>
		<string>Downloads, extracts from the installer app, and imports into Munki the latest version of Red Giant Keying Suite mpkg. 
The selection of packages is performed via installer_choices_xml key, which can be modified via an override. 
Use installer -showChoiceChangesXML -pkg /path/to/mpkg to see options. For more information, see Munki wiki https://github.com/munki/munki/wiki/ChoiceChangesXML.
</string>
    <key>Identifier</key>
		<string>com.github.srgssr.munki.RedGiantKeyingSuite</string>
    <key>Input</key>
    <dict>
      <key>MUNKI_REPO_SUBDIR</key>
      <string>plugins/AfterEffects/RedGiantKeyingSuite</string>
			<key>CC_VERSION_SUBSTRING</key>
			<string>CC18</string>
      <key>pkginfo</key>
      <dict>
        <key>catalogs</key>
        <array>
          <string>testing</string>
        </array>
        <key>category</key>
        <string>Plugins</string>
        <key>description</key>
				<string>Red Giant Keying Suite is a set of 3 tools that make your keying seamless and build the realism of your shot, taking you from the initial matte to the final composite.</string>
        <key>developer</key>
        <string>Red Giant LLC.</string>
        <key>display_name</key>
        <string>Red Giant Keying Suite</string>
        <key>name</key>
        <string>%NAME%</string>
        <key>unattended_install</key>
        <true/>
				<key>installer_choices_xml</key>
				<array>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.Keying.AE.CC18</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.Keying.PrimatteKeyer.AE.CC18</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.Keying.Warp.AE.CC18</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.Keying.KeyCorrect.AE.CC18</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.Keying.FCPX.ALL</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.Keying.PrimatteKeyer.FCPX.ALL</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>1</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.Keying.RGC.ALL</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>1</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.Keying.RedGiantLink.RGC.ALL</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>1</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>postflight</string>
					</dict>
				</array>
      </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>ParentRecipe</key>
		<string>com.github.srgssr.pkg.RedGiantKeyingSuite</string>
    <key>Process</key>
    <array>
			<dict>
				<key>Processor</key>
				<string>DmgCreator</string>
				<key>Arguments</key>
				<dict>
					<key>dmg_root</key>
					<string>%RECIPE_CACHE_DIR%/copied_mpkg</string>
					<key>dmg_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				</dict>
			</dict>
      <dict>
        <key>Processor</key>
        <string>MunkiImporter</string>
        <key>Arguments</key>
        <dict>
          <key>pkg_path</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
          <key>repo_subdirectory</key>
          <string>%MUNKI_REPO_SUBDIR%</string>
        </dict>
      </dict>
			<dict>
				<key>Processor</key>
				<string>RGCCVersionMunkiPkginfoReceiptsEditor</string>
				<key>Arguments</key>
				<dict>
					<key>redgiant_cc_version_substring</key>
					<string>%CC_VERSION_SUBSTRING%</string>
				</dict>
			</dict>
    </array>
  </dict>
</plist>
