<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created by Jens Junge 2022/12</string>
	<key>Description</key>
	<string>Imports Video AI into Munki</string>
	<key>Identifier</key>
	<string>com.github.srgssr.munki.VideoAI</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>VideoAI</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Creative Video</string>
			<key>description</key>
			<string>Unlimited access to the worlds leading production-grade neural networks for video upscaling, deinterlacing, motion interpolation, and shake stabilization - all optimized for your local workstation.</string>
			<key>developer</key>
			<string>TopazLabs</string>
			<key>display_name</key>
			<string>Topaz Video AI</string>
			<key>minimum_os_version</key>
			<string>10.10</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<false/>
			<key>unattended_uninstall</key>
			<false/>
		</dict>
	</dict>
	<key>MiniumumVersion</key>
	<string>1.0</string>
	<key>ParentRecipe</key>
	<string>com.github.srgssr.download.VideoAI</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
