<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of RØDE Central, unpacks it and imports it into a munki_repo.</string>
    <key>Identifier</key>
    <string>ch.srgssr.recipes.munki.RODECentral</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_CATEGORY</key>
        <string>Audio</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/RODECentral</string>
    	<key>NAME</key>
    	<string>RODECentral</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>developer</key>
            <string>RODE</string>
            <key>description</key>
            <string>Unlock advanced features for the Wireless GO II with RØDE Central! This easy-to-use companion app lets you set up your device preferences, access, optimise and export recordings, activate and deactivate functions, and update your firmware.</string>
            <key>display_name</key>
            <string>RODE Central</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>ParentRecipe</key>
    <string>ch.srgssr.recipes.download.RODECentral</string>
    <key>Process</key>
    <array>
               	<dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/flat/RodeCentral.pkg/Payload</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/payload/</string>
            </dict>
            </dict>
             <dict>
        	<key>Processor</key>
			<string>Versioner</string>		
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/Applications/RODE Central.app/Contents/Info.plist</string>
			    <key>plist_version_key</key>
				<string>CFBundleVersion</string>
            </dict>
            </dict>
            <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>version</key>
                    <string>%version%</string>
                </dict>
            </dict>
       </dict>
            <dict>
            <key>Processor</key>
      		<string>DmgCreator</string>
      		<key>Arguments</key>
      		<dict>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/payload/Applications</string>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
			</dict>
		</dict>
            <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
                <key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
            </dict> 
        </dict> 
        <dict>
        <key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
                    <string>%RECIPE_CACHE_DIR%/flat</string>
                    <string>%RECIPE_CACHE_DIR%/downloads</string>
                    <string>%RECIPE_CACHE_DIR%/payload</string>
				</array>
			</dict>
        </dict>
    </array>
</dict>
</plist>