<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.5 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of SecureSafe.</string>
	<key>Identifier</key>
	<string>com.github.srgssr.download.SecureSafe</string>
	<key>Input</key>
	<dict>
		
		<key>NAME</key>
		<string>SecureSafe</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.pkg</string>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>https://www.securesafe.com/de/downloads/</string>
					<key>re_pattern</key>
					<string>(SecureSafe_[0-9\.]+).pkg</string>
					<key>result_output_var_name</key>
					<string>url</string>
				</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>https://www.securesafe.com/downloads/%url%</string>
					<key>filename</key>
					<string>%NAME%.pkg</string>
			
			</dict>	
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/SecureSafe.app</string>
				<key>requirement</key>
				<string>identifier "com.dswiss.securesafe.sync" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = U8DL7XVP69</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/SecureSafe.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
