<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.1.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of SecureSafe.</string>
	<key>Identifier</key>
	<string>com.github.srgssr.download.SecureSafe</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>https://www.dswiss.com/userdata/downloads/securesafe-2.8.0.pkg</string>
		<key>NAME</key>
		<string>SecureSafe</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
<key>Process</key>
	<array>
		<dict>
		<key>Processor</key>
				<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>https://www.securesafe.com/de/</string>
					<key>re_pattern</key>
<<<<<<< HEAD
					<string>(https:\/\/www.securesafe.com\/userdata\/downloads\/securesafe-[0-9].[0-9].[0-9].pkg)</string>
=======
					<string>(https:\/\/www.dswiss.com\/userdata\/downloads\/SecureSafe-[0-9].[0-9].[0-9].pkg)</string>
>>>>>>> parent of 8555e85 (updated download URL)
					<key>result_output_var_name</key>
					<string>url</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>%url%</string>
					<key>filename</key>
					<string>%NAME%.pkg</string>
				</dict>
			</dict>

		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: DSwiss Ltd. (U8DL7XVP69)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>