<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Downloads the BaseHead Installer</string>
	<key>Description</key>
	<string>Downloads the latest version of BaseHead-CM.</string>
	<key>Identifier</key>
	<string>com.github.srgssr.download.BaseHead-CM</string>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Comment</key>
			<string>The download URL would look like this: https://storage.googleapis.com/basehead-downloads/BaseHead/Mac/2020%20Installers/BaseHead%20Mac%202020.9.85.pkg</string>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://storage.googleapis.com/basehead-downloads/BaseHead/Mac/2020%20Installers/</string>
				<key>re_pattern</key>
				<string>(BaseHead%20Mac%2020+[20-99]+.[0-99]+.[0-99]+.pkg)</string>
				<key>result_output_var_name</key>
				<string>file</string>
			</dict>
		</dict>

		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://storage.googleapis.com/basehead-downloads/BaseHead/Mac/2020%20Installers/%file%</string>
	 			<key>filename</key>
				<string>%file%</string>
				<key>prefetch_filename</key>
				<true/>
			</dict>
		</dict>

		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>

		<dict>
            <key>Comment</key>
            <string>Unflatten BaseHeadCM.pkg this gives us a buch of pkgs stored in the unpack subdirectory</string>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>flat_pkg_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
			</dict>
		</dict>

  		<dict>
            <key>Comment</key>
            <string>Expand BaseHead-CM.pkg which contains BaseHead-CM.app</string>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/BaseHead-CM.pkg/Payload</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/payload/</string>
            </dict>
        </dict>

		<dict>
            <key>Comment</key>
            <string>Verify code signature and integrity</string>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/BaseHead-CM.app</string>
				<key>deep_verification</key>
				<true/>
				<key>strict_verification</key>
				<true/>
				<key>requirement</key>
				<string>identifier "com.basehead.BaseHead" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = WVJ3GT3TVW</string>
			</dict>
		</dict>

	</array>
</dict>
</plist>
