<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Imports BaseHead into Munki</string>
	<key>Identifier</key>
	<string>com.github.srgssr.munki.BaseHead</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>BaseHead</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>BaseHeadInc/%NAME%</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Creative Audio</string>
			<key>description</key>
			<string>BaseHead is an Enterprise class Sound Effects Search Engine designed by top working Hollywood Sound Designers.</string>
			<key>developer</key>
			<string>BaseHeadInc</string>
			<key>display_name</key>
			<string>BaseHead</string>
			<key>minimum_os_version</key>
			<string>10.10</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>installer_choices_xml</key>
			<array>
				<dict>
					<key>attributeSetting</key>
					<integer>0</integer>
					<key>choiceAttribute</key>
					<string>selected</string>
					<key>choiceIdentifier</key>
					<string>installer_choice_1</string>
				</dict>
				<dict>
					<key>attributeSetting</key>
					<integer>1</integer>
					<key>choiceAttribute</key>
					<string>selected</string>
					<key>choiceIdentifier</key>
					<string>installer_choice_2</string>
				</dict>
				<dict>
					<key>attributeSetting</key>
					<integer>1</integer>
					<key>choiceAttribute</key>
					<string>selected</string>
					<key>choiceIdentifier</key>
					<string>installer_choice_3</string>
				</dict>
				<dict>
					<key>attributeSetting</key>
					<integer>1</integer>
					<key>choiceAttribute</key>
					<string>selected</string>
					<key>choiceIdentifier</key>
					<string>installer_choice_4</string>
				</dict>
				<dict>
					<key>attributeSetting</key>
					<integer>1</integer>
					<key>choiceAttribute</key>
					<string>selected</string>
					<key>choiceIdentifier</key>
					<string>installer_choice_5</string>
				</dict>
			</array>
			<key>uninstall_method</key>
			<string>removepackages</string>
		</dict>
	</dict>
	<key>MiniumumVersion</key>
	<string>1.0</string>
	<key>ParentRecipe</key>
	<string>com.github.srgssr.download.BaseHead</string>
	<key>Process</key>
	<array>
		<!-- Unflatten BaseHead.pkg -->
		<dict>        
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>flat_pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.pkg</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
			</dict>
		</dict>

		<!-- Expand BaseHead-CM.pkg -->
  		<dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/%NAME%-CM.pkg/Payload</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/payload/</string>
            </dict>
        </dict>

		<!-- Create Installs item from payload/Application/BaseHead-CM.app -->
		<dict>
			<key>Processor</key>
			<string>MunkiInstallsItemsCreator</string>
			<key>Arguments</key>
			<dict>
				<key>faux_root</key>
				<string>%RECIPE_CACHE_DIR%/payload</string>
				<key>installs_item_paths</key>
				<array>
					<string>/Applications/BaseHead-CM.app/Contents/MacOS/BaseHead-CM</string>			
				</array>		
			</dict>
		</dict>
		<dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>   

	<!-- Get Version from BaseHead-CM.app and merge it into pkginfo 
		 For now the version inside the app is wrong thus this code is commented out.	
 		<dict>
			<key>Processor</key>
			<string>Versioner</string>		
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/Applications/%NAME%-CM.app/Contents/Info.plist</string>
			</dict>
		</dict>
	-->
		<!-- Get Version from distribution package -->
		<dict>
			<key>Processor</key>
			<string>com.facebook.autopkg.shared/PackageInfoVersioner</string>
			<key>Arguments</key>
			<dict>
				<key>package_info_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/%NAME%-CM.pkg/PackageInfo</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>version</key>
					<string>%version%</string>	
				</dict>
			</dict>
		</dict>
        <!-- Import into Munki -->
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.pkg</string>			
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>				
			</dict>
		</dict>

        <!-- clean up -->
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>		
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
					<string>%RECIPE_CACHE_DIR%/payload</string>
				</array>
			</dict>		
		</dict>
	</array>
</dict>
</plist>