<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
		<key>Attribution</key>
		<dict>
			<key>Copyright</key>
			<array>
				<string>SRG SSR</string>
			</array>
			<key>Authors</key>
			<dict>
				<key>Name</key>
				<array>
					<string>Antti Pettinen</string>
				</array>
				<key>Email</key>
				<array>
					<string>a.pettinen at gmail.com</string>
				</array>
				<key>Github</key>
				<array>
					<string>apettinen</string>
				</array>
			</dict>
		</dict>
    <key>Description</key>
		<string>Downloads, extracts from the installer app, and imports into Munki the latest version of Red Giant Shooter Suite mpkg. 
The selection of packages is performed via installer_choices_xml key, which can be modified via an override. 
Use installer -showChoiceChangesXML -pkg /path/to/mpkg to see options. For more information, see Munki wiki https://github.com/munki/munki/wiki/ChoiceChangesXML
</string>
    <key>Identifier</key>
		<string>com.github.srgssr.munki.RedGiantShooterSuite</string>
    <key>Input</key>
    <dict>
      <key>MUNKI_REPO_SUBDIR</key>
      <string>plugins/AfterEffects/RedGiantShooterSuite</string>
			<key>CC_VERSION_SUBSTRING</key>
			<string>CC18</string>
      <key>pkginfo</key>
      <dict>
        <key>catalogs</key>
        <array>
          <string>testing</string>
        </array>
        <key>category</key>
        <string>Plugins</string>
        <key>description</key>
				<string>Red Giant Shooter Suite is a set of stand-alone applications and plug-ins that gives you the freedom to shoot the way you want, with the confidence that your footage will make it from your camera to the editing timeline safe, sound and in sync.
Shooter Suite includes Shooter PluralEyes, a stand-alone application that gives you the most accurate A/V sync available for any non-linear editor. PluralEyes syncs audio and multi-camera video with the touch of a single button, in seconds. And while it works with many NLEs, PluralEyes can also sync directly in Adobe Premiere Pro, so you never have to leave the app.</string>
        <key>developer</key>
        <string>Red Giant LLC.</string>
        <key>display_name</key>
        <string>Red Giant Shooter Suite</string>
        <key>name</key>
        <string>%NAME%</string>
        <key>unattended_install</key>
        <true/>
				<key>installer_choices_xml</key>
				<array>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.ShooterSuite.AE.CC18</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.ShooterSuite.Frames.AE.CC18</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.ShooterSuite.InstantHD.AE.CC18</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.ShooterSuite.PPro.CC18</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.ShooterSuite.Frames.PPro.CC18</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.ShooterSuite.InstantHD.PPro.CC18</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>1</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.ShooterSuite.SA.ALL</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>1</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.ShooterSuite.Offload.SA.ALL</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>1</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.ShooterSuite.PluralEyes4.SA.ALL</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>1</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.ShooterSuite.RGC.ALL</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>1</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.ShooterSuite.RedGiantLink.RGC.ALL</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>1</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>postflight</string>
					</dict>
				</array>
      </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>ParentRecipe</key>
		<string>com.github.srgssr.pkg.RedGiantShooterSuite</string>
    <key>Process</key>
    <array>
		<!--
			<dict>
				<key>Processor</key>
				<string>MunkiPkginfoMerger</string>
				<key>Arguments</key>
				<dict>
					<key>additional_pkginfo</key>
					<dict>
					</dict>
				</dict>
			</dict>-->
			<dict>
				<key>Processor</key>
				<string>DmgCreator</string>
				<key>Arguments</key>
				<dict>
					<key>dmg_root</key>
					<string>%RECIPE_CACHE_DIR%/copied_mpkg</string>
					<key>dmg_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				</dict>
			</dict>
      <dict>
        <key>Processor</key>
        <string>MunkiImporter</string>
        <key>Arguments</key>
        <dict>
          <key>pkg_path</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
          <key>repo_subdirectory</key>
          <string>%MUNKI_REPO_SUBDIR%</string>
        </dict>
      </dict>
			<dict>
				<key>Processor</key>
				<string>RGCCVersionMunkiPkginfoReceiptsEditor</string>
				<key>Arguments</key>
				<dict>
					<key>redgiant_cc_version_substring</key>
					<string>%CC_VERSION_SUBSTRING%</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PathDeleter</string>
				<key>Arguments</key>
				<dict>
					<key>path_list</key>
					<array>
						<string>%RECIPE_CACHE_DIR%/copied_mpkg</string>
					</array>
				</dict>
			</dict>
    </array>
  </dict>
</plist>
