<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads Sony i.Link FAM Driver and imports it to Munki</string>
	<key>Identifier</key>
	<string>com.github.srgssr.munki.SonyFAMDriver</string>
	<key>MinimumVersion</key>
	<string>0.6.0</string>
	<key>ParentRecipe</key>
	<string>com.github.srgssr.pkg.SonyFAMDriver</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_NAME</key>
		<string>Sony_FAMDriver</string>
		<key>MUNKI_DISPLAY_NAME</key>
		<string>Sony FAM Driver</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>Sony/FAMDriver</string>
		<key>MUNKI_CATEGORY</key>
		<string>Driver</string>
		<key>MUNKI_DEVELOPER</key>
		<string>Sony</string>
		<key>MUNKI_DESCRIPTION</key>
		<string>Mit der Treibersoftware i.LINK FAM Driver können Benutzer von einem Computer, der mit einem XDCAM-Produkt wie PDW-F1600, PDW-HD1500 usw. verbunden ist, Dateioperationen nach Dateizugriffsmodus (File Access Mode, nachfolgend FAM genannt) vornehmen.</string>
		<key>PKG_PAYLOAD_PATH</key>
		<string>FAM_Driver.pkg/Payload</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>name</key>
			<string>%MUNKI_NAME%</string>
			<key>display_name</key>
			<string>%MUNKI_DISPLAY_NAME%</string>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>developer</key>
			<string>%MUNKI_DEVELOPER%</string>
			<key>description</key>
			<string>%MUNKI_DESCRIPTION%</string>
			<key>RestartAction</key>
			<string>RequireRestart</string>
		</dict>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>flat_pkg_path</key>
				<string>%pkg_path%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpacked</string>
				<key>purge_destination</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpacked/%PKG_PAYLOAD_PATH%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/</string>
				<key>purge_destination</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Versioner</string>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/Library/Extensions/FAMProtocol.kext/Contents/Info.plist</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiInstallsItemsCreator</string>
			<key>Arguments</key>
			<dict>
				<key>faux_root</key>
				<string>%RECIPE_CACHE_DIR%/payload/</string>
				<key>installs_item_paths</key>
				<array>
					<string>/Library/Extensions/FAMProtocol.kext</string>
					<string>/Library/Extensions/prodisc_fs.kext</string>
					<string>/Library/Filesystems/prodiscfs.fs</string>
				</array>
				<key>version_comparison_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<!-- write version so we get the package names right -->
		<dict>
				<key>Processor</key>
				<string>MunkiPkginfoMerger</string>
				<key>Arguments</key>
				<dict>
						<key>additional_pkginfo</key>
						<dict>
								<key>version</key>
								<string>%version%</string>
						</dict>
				</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/payload</string>
					<string>%RECIPE_CACHE_DIR%/unpacked</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
