<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the specified version of the Sony i.LINK FAM Driver. Please note that the download URL might change and the NAME is the name of the pkg inside the dmg inside the downloaded zip. Change accordingly if needed.</string>
		<key>Identifier</key>
    <string>com.github.srgssr.download.SonyFAMDriver</string>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Sony_FAMDriver</string>
        <key>URL</key>
				<string>https://www.sonycreativesoftware.com/de/download/link?id=10109.0</string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%URL%</string>
								<key>filename</key>
								<string>%NAME%.zip</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
