<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for QGIS. Finds and downloads a QGIS release.
		VERSION corresponds to files at http://www.kyngchaos.com/files/software/qgis/QGIS-$VERSION.dmg
		Examples include '2.6.1-1', '2.6.1-2', '2.8.1-1'
	</string>
    <key>Identifier</key>
    <string>com.github.srgssr.munki.download.qgis</string>
    <key>Input</key>
    <dict>
        <key>VERSION</key>
        <string>latest</string>
        <key>NAME</key>
        <string>QGIS</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>https://qgis.org/downloads/macOS</string>
					<key>re_pattern</key>
					<string>(QGIS-macOS-[3-9\.]+-[0-9].dmg)</string>
					<key>result_output_var_name</key>
					<string>url</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>https://qgis.org/downloads/macOS/%url%</string>
					<key>filename</key>
					<string>%NAME%.dmg</string>
				</dict>
			</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%filename%/2 Install QGIS 3.pkg</string>
				<key>extract_root</key>
				<string>%RECIPE_CACHE_DIR%/downloads/unpack/PKGExtractor</string>
			</dict>
			<key>Processor</key>
			<string>PkgExtractor</string>
		</dict>
	        <dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%filename%/2 Install QGIS 3.pkg/QGIS3.app/Contents</string>
                <key>destination_path</key>
                <string>%%RECIPE_CACHE_DIR%/downloads/payload</string>
            </dict>
        </dict>

					<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%destination_path%/QGIS3.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
		</array>
</dict>
</plist>


