<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for QGIS. Finds and downloads a QGIS release.
		VERSION corresponds to files at http://www.kyngchaos.com/files/software/qgis/QGIS-$VERSION.dmg
		Examples include '2.6.1-1', '2.6.1-2', '2.8.1-1'
	</string>
    <key>Identifier</key>
    <string>com.github.srgssr.munki.download.qgis</string>
    <key>Input</key>
    <dict>
        <key>VERSION</key>
        <string>latest</string>
        <key>NAME</key>
        <string>QGIS</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>https://qgis.org/downloads/macOS</string>
					<key>re_pattern</key>
					<string>(QGIS-macOS-[3-9\.]+-[0-9].dmg)</string>
					<key>result_output_var_name</key>
					<string>url</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>https://qgis.org/downloads/macOS/%url%</string>
					<key>filename</key>
					<string>%NAME%.dmg</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
		</array>
</dict>
</plist>


