<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for QGIS LTR.</string>
    <key>Identifier</key>
    <string>com.github.srgssr.download.QGIS</string>
    <key>Input</key>
    <dict>
        <key>VERSION</key>
        <string>latest</string>
        <key>NAME</key>
        <string>QGIS</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>https://qgis.org/downloads/macos/qgis-macos-ltr.dmg</string>
					<key>filename</key>
					<string>%NAME%.dmg</string>
				</dict>
			</dict>
		</array>
    </dict>
</plist>
