<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
		<key>Attribution</key>
		<dict>
			<key>Copyright</key>
			<array>
				<string>SRG SSR</string>
			</array>
			<key>Authors</key>
			<dict>
				<key>Name</key>
				<array>
					<string>Antti Pettinen</string>
				</array>
				<key>Email</key>
				<array>
					<string>a.pettinen at gmail.com</string>
				</array>
				<key>Github</key>
				<array>
					<string>apettinen</string>
				</array>
			</dict>
		</dict>
    <key>Description</key>
		<string>Downloads, extracts from the installer app, and imports into Munki the latest version of Red Giant Magic Bullet Suite mpkg. 
The selection of packages is performed via installer_choices_xml key, which can be modified via an override. 
Use installer -showChoiceChangesXML -pkg /path/to/mpkg to see options. For more information, see Munki wiki https://github.com/munki/munki/wiki/ChoiceChangesXML
</string>
    <key>Identifier</key>
		<string>com.github.srgssr.munki.RedGiantMagicBulletSuite</string>
    <key>Input</key>
    <dict>
      <key>MUNKI_REPO_SUBDIR</key>
      <string>plugins/AfterEffects/RedGiantMagicBulletSuite</string>
			<key>CC_VERSION_SUBSTRING</key>
			<string>CC18</string>
      <key>pkginfo</key>
      <dict>
        <key>catalogs</key>
        <array>
          <string>testing</string>
        </array>
        <key>category</key>
        <string>Plugins</string>
        <key>description</key>
				<string>Magic Bullet Suite is a set of seven tools that bring intuitive, real time color correction, and beyond, right to your editorial timeline.</string>
        <key>developer</key>
        <string>Red Giant LLC.</string>
        <key>display_name</key>
        <string>Red Giant Magic Bullet Suite</string>
        <key>name</key>
        <string>%NAME%</string>
        <key>unattended_install</key>
        <true/>
				<key>installer_choices_xml</key>
				<array>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.MagicBulletSuite.AE.CC18</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.MagicBulletSuite.ColoristaIV.AE.CC18</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.MagicBulletSuite.CosmoII.AE.CC18</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.MagicBulletSuite.Film.AE.CC18</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.MagicBulletSuite.Looks.AE.CC18</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.MagicBulletSuite.MojoII.AE.CC18</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.MagicBulletSuite.DenoiserIII.AE.CC18</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.MagicBulletSuite.Renoiser.AE.CC18</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.MagicBulletSuite.FCPX.ALL</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.MagicBulletSuite.ColoristaIV.FCPX.ALL</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.MagicBulletSuite.DenoiserIII.FCPX.ALL</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.MagicBulletSuite.Looks.FCPX.ALL</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.MagicBulletSuite.MojoII.FCPX.ALL</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.MagicBulletSuite.Film.FCPX.ALL</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.MagicBulletSuite.Renoiser.FCPX.ALL</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.MagicBulletSuite.CosmoII.FCPX.ALL</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.MagicBulletSuite.Motion.ALL</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.MagicBulletSuite.ColoristaIV.Motion.ALL</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.MagicBulletSuite.DenoiserIII.Motion.ALL</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.MagicBulletSuite.CosmoII.Motion.ALL</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.MagicBulletSuite.Film.Motion.ALL</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.MagicBulletSuite.Looks.Motion.ALL</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.MagicBulletSuite.MojoII.Motion.ALL</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.MagicBulletSuite.Renoiser.Motion.ALL</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.MagicBulletSuite.AVX.ALL</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.MagicBulletSuite.Looks.AVX.ALL</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.MagicBulletSuite.DaVR.ALL</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.MagicBulletSuite.CosmoII.DaVR.ALL</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.MagicBulletSuite.Film.DaVR.ALL</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.MagicBulletSuite.MojoII.DaVR.ALL</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.MagicBulletSuite.Looks.DaVR.ALL</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.MagicBulletSuite.Renoiser.DaVR.ALL</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.MagicBulletSuite.HitFilm.ALL</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.MagicBulletSuite.CosmoII.HitFilm.ALL</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.MagicBulletSuite.Film.HitFilm.ALL</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.MagicBulletSuite.MojoII.HitFilm.ALL</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.MagicBulletSuite.Looks.HitFilm.ALL</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>0</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.MagicBulletSuite.Renoiser.HitFilm.ALL</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>1</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.MagicBulletSuite.RGC.ALL</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>1</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.MagicBulletSuite.RedGiantLink.RGC.ALL</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>1</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.MagicBulletSuite.MBOSL.ALL</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>1</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.MagicBulletSuite.MagicBulletOpenSourceList.MBOSL.ALL</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>1</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.MagicBulletSuite.GPU.ALL</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>1</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>com.redgiant.MagicBulletSuite.Gpu-Shader-Engine.GPU.ALL</string>
					</dict>
					<dict>
						<key>attributeSetting</key>
						<integer>1</integer>
						<key>choiceAttribute</key>
						<string>selected</string>
						<key>choiceIdentifier</key>
						<string>postflight</string>
					</dict>
				</array>
      </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>ParentRecipe</key>
		<string>com.github.srgssr.pkg.RedGiantMagicBulletSuite</string>
    <key>Process</key>
    <array>
			<dict>
				<key>Processor</key>
				<string>DmgCreator</string>
				<key>Arguments</key>
				<dict>
					<key>dmg_root</key>
					<string>%RECIPE_CACHE_DIR%/copied_mpkg</string>
					<key>dmg_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				</dict>
			</dict>
      <dict>
        <key>Processor</key>
        <string>MunkiImporter</string>
        <key>Arguments</key>
        <dict>
          <key>pkg_path</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
          <key>repo_subdirectory</key>
          <string>%MUNKI_REPO_SUBDIR%</string>
        </dict>
      </dict>
			<dict>
				<key>Processor</key>
				<string>RGCCVersionMunkiPkginfoReceiptsEditor</string>
				<key>Arguments</key>
				<dict>
					<key>redgiant_cc_version_substring</key>
					<string>%CC_VERSION_SUBSTRING%</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PathDeleter</string>
				<key>Arguments</key>
				<dict>
					<key>path_list</key>
					<array>
						<string>%RECIPE_CACHE_DIR%/copied_mpkg</string>
					</array>
				</dict>
			</dict>
    </array>
  </dict>
</plist>
