<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Imports Inkspace into Munki</string>
	<key>Identifier</key>
	<string>com.github.srgssr.munki.Inkspace</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Inkspace</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>Wacom/%NAME%</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Creative</string>
			<key>description</key>
			<string>Mit der Wacom Inkspace App kannst du deine auf Papier erstellten Arbeiten hegen und pflegen. Du kannst handschriftliche Notizen in Text und Skizzen in Bild-, Vektor- oder Videodateiformate verwandeln, um sie dann in der Kreativsoftware deiner Wahl zu bearbeiten.</string>
			<key>developer</key>
			<string>Wacom</string>
			<key>display_name</key>
			<string>Inkspace</string>
			<key>minimum_os_version</key>
			<string>10.14</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MiniumumVersion</key>
	<string>1.0</string>
	<key>ParentRecipe</key>
	<string>com.github.srgssr.download.Inkspace</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>DmgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/payload/</string>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>		
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
				    <string>%RECIPE_CACHE_DIR%/payload</string>
					<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				</array>
			</dict>		
		</dict>
	</array>
</dict>
</plist>
