<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Imports NexThink Collector Uninstaller pkg into Munki.</string>
	<key>Comment</key>
	<string>20230808 created by Jens Junge, standing on the shoulders of giants - thank you Rich.</string>
	<key>Identifier</key>
	<string>com.github.srgssr.munki.NexthinkCollectorUninstaller</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/NexThinkCollector/</string>
         <key>NAME</key>
         <string>NexThink Collector Uninstaller</string>
		<key>MUNKI_CATEGORY</key>
		<string>Tools</string>
         <key>VENDOR</key>
         <string>NexThink</string>
         <key>SOFTWARETITLE1</key>
         <string>Collector</string>
         <key>SOFTWARETITLE2</key>
         <string>Uninstaller</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>This is the uninstaller for Nexthink Collector</string>
			<key>display_name</key>
			<string>NexThink Collector Uninstaller</string>
			<key>developer</key>
			<string>NexThink</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.rtrouton.pkg.NexThinkCollectorUninstaller</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%VENDOR%_%SOFTWARETITLE1%_%SOFTWARETITLE2%_%version%.pkg</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
