<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Imports NexThinkCollector pkg into Munki.</string>
	<key>Comment</key>
	<string>20230808 created by Jens Junge, standing on the shoulders of giants - thank you Rich.</string>
	<key>Identifier</key>
	<string>com.github.srgssr.munki.NexthinkCollector</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/NexThinkCollector/</string>
		<key>NAME</key>
		<string>NexThinkCollector</string>
		<key>MUNKI_CATEGORY</key>
		<string>Tools</string>
		 <key>VENDOR</key>
		 <string>NexThink</string>
		 <key>SOFTWARETITLE</key>
		 <string>Collector</string>
		 <key>NTTCPPORT</key>
		 <string>443</string>
		 <key>NTUDPPORT</key>
		 <string></string>
		 <key>NTPROXYPACADDRESS</key>
		 <string></string>
		 <key>NTPROXYADDRESS</key>
		 <string></string>
		 <key>NTPROXYPORT</key>
		 <string></string>
		 <key>NTREMOTEACTIONS</key>
		 <string>disabled</string>
		 <key>NTENGAGE</key>
		 <string>disable</string>
		 <key>NTASSIGNMENT</key>
		 <string>enable</string>
		 <key>NTDATAOVERTCP</key>
		 <string>enable</string>
		 <key>NTSERVERADDRESS</key>
		 <string>Put_nextthink_server_address_into_AutoPkg_recipe_override</string>
		 <key>NTSTRINGTAG</key>
		 <string></string>
		 <key>NTCUSTOMERKEYNAME</key>
		 <string>nexthink-customer-key.txt</string>
		 <key>NTCUSTOMERKEYDATA</key>
		 <string>Put_nextthink_customer_key_data_into_AutoPkg_recipe_override</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>The Collector is a light-weight agent. It captures and reports network connections, program executions, web requests, and many other activities and properties from the devices of the end-users on which it runs. It is implemented as a kernel driver and an accompanying service, offering remote and automated silent installations and negligible impact on the performance of local desktops, while minimizing network traffic.</string>
			<key>display_name</key>
			<string>NexThinkCollector</string>
			<key>developer</key>
			<string>NexThink</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.rtrouton.pkg.NexThinkCollector</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%VENDOR%_%SOFTWARETITLE%_%version%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
