<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Imports the latest version of ChronoSync into Munki.</string>
	<key>Comment</key>
	<string>Created by BitsDream, inspired by homebysix.</string>
	<key>Identifier</key>
	<string>com.github.srgssr.munki.ChronoSync</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>ChronoSync</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>ChronoSync.app</string>
				<string>ChronoAgentLocal.app</string>
				<string>WakeToSyncTool</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Reliable backups, drive clones, and folder synchronizations.</string>
			<key>developer</key>
			<string>EconTechnologies</string>
			<key>display_name</key>
			<string>ChronoSync</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>postinstall_script</key>
			<string>#!/bin/zsh
MACADRESS=$(ifconfig en0 | awk '/ether/{print $2}' | cut -d' ' -f2 | tr -d :)
LICENSEDIR="/Library/Application Support/ChronoSync"
LICENSEFILE="$LICENSEDIR"/.license_04"$MACADRESS"
mkdir -p "$LICENSEDIR"
# Writing Licensing information. Replce with your own license.
echo '&lt;YOUR LICENSENUMBER GOES HERE&gt;
&lt;YOUR COMPANY NAME GOES HERE&gt;
&lt;YOUR NAME GOES HERE&gt;
' &gt; "$LICENSEFILE"

# Some Voodoo that's in the original postinstall script just for the sake of their mind.
chronoSyncFolder="/Library/Application Support/ChronoSync/"
if [[ -d "$chronoSyncFolder" ]]; then
		chown root:admin "$chronoSyncFolder"
		chmod 0775 "$chronoSyncFolder"
fi

wakeToSyncToolPath="/Library/Application Support/ChronoSync/WakeToSyncTool"
if [[ -d "$wakeToSyncToolPath" ]]; then
        chown root:admin "$wakeToSyncToolPath"
        chmod 0555 "$wakeToSyncToolPath"
        chmod u+s "$wakeToSyncToolPath"
fi

chmod 4555 "/Library/Application Support/ChronoSync/ChronoAgentLocal.app/Contents/MacOS/ChronoAgentLocal"</string>
			<key>preinstall_script</key>
			<string>#!/bin/zsh

# kill off all the backgrounders
killall ChronoSyncBackgrounder
killall "ChronoSync Scheduler"

exit 0</string>
			<key>preuninstall_script</key>
			<string>#!/bin/bash
/bin/rm -rf "/Library/Application Support/ChronoSync"</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>ParentRecipe</key>
	<string>com.github.srgssr.pkg.ChronoSync</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
