<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and imports the current release version of VeraCrypt into Munki</string>
	<key>Identifier</key>
	<string>com.github.srgssr.munki.VeraCrypt</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>VeraCrypt</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>utilities/VeraCrypt</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>display_name</key>
			<string>%NAME%</string>
			<key>name</key>
			<string>%NAME%</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>ParentRecipe</key>
	<string>com.github.srgssr.pkg.VeraCrypt</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>pkginfo</key>
				<dict>
					<key>category</key>
					<string>Utilities</string>
					<key>description</key>
					<string>VeraCrypt is an open-source utility used for on-the-fly encryption. It can create a virtual encrypted disk within a file or encrypt an entire partition.</string>
					<key>developer</key>
					<string>IDRIX</string>
					<key>requires</key>
					<array>
						<string>osxfuse</string>
					</array>
				</dict>
			</dict>
		</dict>
	</array>
</dict>
</plist>
