<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.1.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of PlatformM.</string>
	<key>Identifier</key>
	<string>com.github.srgssr.download.PlatformM+</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>PlatformM+</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://iconproaudio.com/product/platform-m-plus/</string>
                <key>re_pattern</key>
                <string>(https://s3.amazonaws.com/assets.icon-global.com/wp-content/uploads/2020/12/PlatformMPlus_and_XPlus_iMap_Mac_Setup_V2.+\.zip)</string>
		        <key>result_output_var_name</key>
		        <string>url</string>
        	</dict>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.zip</string>
				<key>url</key>
				<string>%url%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
      		<key>Processor</key>
      		<string>Unarchiver</string>
      		<key>Arguments</key>
      	<dict>
        	<key>purge_destination</key>
			 <true/>
			 <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/PlatformM+</string>
       		</dict>
	  </dict>  
	</array>
</dict>
</plist>
