<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.1.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of PlatformM+ and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.srgssr.munki.PlatformM+</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>SW/iCONProAudio/PlatformM+</string>
		<key>NAME</key>
		<string>Platform M+ and X+ iMap</string>
		<key>MUNKI_CATEGORY</key>
		<string>Multimedia</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
            <string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>.  The Platform M+ is a MIDI control surface designed for producers, engineers and musicians who want the hands on control of real faders on a mixing console PLUS the flexibility of modern “in the box” or touchscreen digital music production within a smaller physical workspace.</string>
			<key>display_name</key>
			<string>Platform M+ and X+</string>
			<key>developer</key>
            <string>iCON Pro Audio</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.srgssr.download.PlatformM+</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
