<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created by Jens Junge, 2021-06-23</string>
	<key>Description</key>
	<string>Imports Adobe Acrobat Pro DC into Munki.</string>
	<key>Identifier</key>
	<string>com.github.srgssr.recipes.munki.AdobeAcrobatProDC</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>AdobeAcrobatProDC</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>Adobe/%NAME%</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Creative</string>
			<key>description</key>
			<string>Hier finden Sie das brandneue Adobe Acrobat Pro DC mit Adobe Document Cloud-Diensten. Dank neu konzipierter PDF-Tools können Sie PDF-Dokumente von überall aus erstellen, bearbeiten, signieren und nachverfolgen. Dies wird Ihre Arbeit mit Entwurfslayouts, druckfertigen Dateien und wichtigen Dokumenten für immer revolutionieren.</string>
			<key>developer</key>
			<string>Adobe</string>
			<key>display_name</key>
			<string>Adobe Acrobat Pro DC</string>
			<key>minimum_os_version</key>
			<string>10.14</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MiniumumVersion</key>
	<string>1.0</string>
	<key>ParentRecipe</key>
	<string>com.github.srgssr.recipes.download.AdobeAcrobatProDC</string>
	<key>Process</key>
	<array>
		<dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%pathname%/Acrobat DC/Acrobat DC Installer.pkg</string>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
            </dict>
        </dict>
 		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pkg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>		
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/payload</string>
					<string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
				</array>
			</dict>
		</dict>	
	</array>
</dict>
</plist>