<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads Telestream ScreenFlow Audio Driver</string>
	<key>Identifier</key>
	<string>com.github.srgssr.download.ScreenFlowAudioDriver</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>ScreenFlowAudioDriver</string>
		<key>DOWNLOADURL</key>
		<string>http://www.telestream.net/download-files/screenflow/TelestreamAudio.pkg.zip</string>
	</dict>
	<key>MiniumumVersion</key>
	<string>1.0</string>
	<key>Process</key>
	<array>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>%DOWNLOADURL%</string>
					<key>filename</key>
					<string>%NAME%.zip</string>
				</dict>
			</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>download_changed == FALSE</string>
            </dict>
        </dict>
		<dict>
            <key>Comment</key>
            <string>unzip the the PKG</string>
            <key>Processor</key>
            <string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unzip/</string>
				<key>archive_format</key>
				<string>zip</string>
			</dict>
		</dict>
        <dict>
            <key>Comment</key>
            <string>Unpack flat pkg to unpack folder.</string>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>flat_pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/unzip/TelestreamAudio.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
            </dict>
        </dict>
         <dict>
            <key>Comment</key>
            <string>Unpack kext inside the directory "unpack" to the directory "payload/Library/Extensions" for later creation of installs section.</string>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/TelestreamAudioDriverSigned.pkg/Payload</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/payload/Library/Extensions</string>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Verify Signature of TelestreamAudioDriverSigned.kext</string>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/payload/Library/Extensions/TelestreamAudio.kext</string>
                <key>requirement</key>
                <string>identifier "net.telestream.driver.TelestreamAudio" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = WSG985FR47</string>
            </dict>
        </dict>
		<dict>
            <key>Comment</key>
            <string>Purge everything we no longer need</string>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<!-- we stil need the unzip for Munki Import and payload for versioning and installs -->
					<string>%RECIPE_CACHE_DIR%/unpack</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>