<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of TeamViewerQS and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.srgssr.munki.TeamViewerQSCustom</string>
	<key>Input</key>
	<dict>
        <key>ORG_NAME</key>
		<string>p l e a s e     c h a n g e     m e</string>
		<key>CONFIGURATION_ID</key>
		<string>p l e a s e     c h a n g e     m e</string>
		<key>TEAMVIEWER_VERSION</key>
		<string>15</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/TeamViewer/%NAME%-%ORG_NAME%</string>
		<key>NAME</key>
		<string>TeamViewerQS %ORG_NAME%</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string> </string>
			<key>developer</key>
			<string>TeamViewer GmbH</string>
			<key>display_name</key>
			<string>TeamViewerQS %ORG_NAME%</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.srgssr.download.TeamViewerQSCustom</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%ORG_NAME%.dmg</string>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/unzipped/%ORG_NAME%/TeamViewerQS %ORG_NAME%.app</string>
			</dict>
			<key>Processor</key>
			<string>DmgCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%dmg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>