<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest custom TeamViewer QuickSupport zip for multiple quicksupport custom Versions. The ORG_NAME variable should exactly reflect the organisation name and the configurationID should exactly reflect the configuration-ID from the Teamviewer custom installer</string>
	<key>Identifier</key>
	<string>com.github.srgssr.download.TeamViewerQSCustom</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>TeamViewerQSCustom</string>
		<key>ORG_NAME</key>
		<string></string>
		<key>CONFIGURATION_ID</key>
		<string></string>
		<key>TEAMVIEWER_VERSION</key>
		<string></string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.2</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
                                <string>https://customdesignservice.teamviewer.com/download/mac/v%TEAMVIEWER_VERSION%/%CONFIGURATION_ID%/TeamViewerQS.zip</string>
				<key>download_dir</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%ORG_NAME%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unzipped/</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/unzipped/TeamViewerQS.app</string>
				<key>requirement</key>
				<string>anchor apple generic and identifier "com.teamviewer.TeamViewerQS" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = H7UGFBUGV6)</string>
				<key>strict_verification</key>
				<true />
			</dict>
		</dict>
	</array>
</dict>
</plist>