<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of PunchLight USB Utility.</string>
	<key>Identifier</key>
	<string>com.github.srgssr.download.PunchLightUSBUtility</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>PunchLight USB utility</string>
		<key>URL</key>
		<string>https://www.punchlight.com/download</string>
		<key>NAME</key>
		<string>PunchLight USB Utility</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
					<key>url</key>
					<string>%URL%</string>
					<key>result_output_var_name</key>
					<string>download_url_adding</string>
					<key>re_pattern</key>
					<string>.*href="([^"]+.*USB.*dmg)"</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
					<key>url</key>
					<string>https://www.punchlight.com%download_url_adding%</string>
					<key>filename</key>
					<string>%NAME%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
