<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Composer php command line tool.</string>
	<key>Identifier</key>
	<string>com.github.ygini.download.PHPComposer</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>composer</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>href="/download/([\d\.]+)/composer.phar"</string>
				<key>result_output_var_name</key>
				<string>version</string>
				<key>url</key>
				<string>https://getcomposer.org/download/</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.phar</string>
				<key>url</key>
				<string>https://getcomposer.org/download/%version%/composer.phar</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>