<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of PHPcomposer and makes a pkg of it</string>
    <key>Identifier</key>
    <string>com.github.SRGSSR.pkg.PHPcomposer</string>
    <key>Input</key>
    <dict>
        <key>PKG_ID</key>
        <string>com.github.ygini.pkg.PHPcomposer</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>ParentRecipe</key>
    <string>com.github.SRGSSR.download.PHPcomposer</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>pkgdirs</key>
                <dict>
                    <key>usr</key>
                    <string>0755</string>
                    <key>usr/local</key>
                    <string>0775</string>
                    <key>usr/local/bin</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%pkgroot%/usr/local/bin/</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgname</key>
                    <string>%NAME%-%version%</string>
                    <key>pkgdir</key>
                    <string>%pkgroot%</string>
                    <key>id</key>
                    <string>%PKG_ID%</string>
                    <key>version</key>
                    <string>%version%</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
    				<array>
    					<dict>
    						<key>path</key>
                    		<string>/usr</string>
    						<key>user</key>
                    		<string>root</string>
    						<key>group</key>
                    		<string>wheel</string>
    					</dict>
    					<dict>
    						<key>path</key>
                    		<string>/usr/local/bin/%NAME%.phar</string>
    						<key>user</key>
                    		<string>root</string>
    						<key>group</key>
                    		<string>wheel</string>
    						<key>mode</key>
                    		<string>0755</string>
    					</dict>
				    </array>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>