<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Import PHPcomposer in Munki</string>
    <key>Identifier</key>
    <string>com.github.SRGSSR.munki.PHPcomposer</string>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>Input</key>
    <dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>Composer/PHPcomposer</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <false/>
            <key>developer</key>
            <string>Nils Adermann, Jordi Boggiano and many community contributions</string>
            <key>category</key>
            <string>Developer</string>
			<key>description</key>
			<string>Composer is a tool for dependency management in PHP. It allows you to declare the libraries your project depends on and it will manage (install/update) them for you.</string>
			<key>display_name</key>
			<string>PHP Composer</string>
        </dict>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.SRGSSR.pkg.PHPcomposer</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pkg_path%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
		<dict>
			<key>Comment</key>
			<string>Purge everything we no longer need</string>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				</array>
			</dict>
		</dict>
    </array>
</dict>
</plist>