<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads ZaxConvert, erstellt ein PKG und importiert es in Munki.</string>
    <key>Identifier</key>
    <string>com.github.srgssr.recipes.munki.ZaxConvert</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>NAME</key>
        <string>ZaxConvert</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Tool zur Konvertierung von Zaxcom-Aufnahmen inkl. LAME mp3 Encoder</string>
            <key>developer</key>
            <string>ZaxConvert</string>
            <key>display_name</key>
            <string>ZaxConvert</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.srgssr.download.ZaxConvert</string>
    <key>Process</key>
    <array>
        <!-- Version aus url auslesen -->
<dict>
    <key>Processor</key>
    <string>URLTextSearcher</string>
    <key>Arguments</key>
    <dict>
        <key>url</key>
        <string>https://zaxcom.com/product/zaxconvert/</string>
        <key>re_pattern</key>
        <string>Zaxconvert_(?P<version>[\d.]+)_PC_MAC\.zip</string>
        <key>result_output_var_name</key>
        <string>url</string>
    </dict>
</dict>

        <!-- App in PKG verpacken -->
        <dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>app_path</key>
                <string>%RECIPE_CACHE_DIR%/source/ZaxConvert.app</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/ZaxConvert.pkg</string>
                <key>version</key>
                <string>%version%</string>
            </dict>
        </dict>

        <!-- PKG in Munki importieren -->
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/ZaxConvert.pkg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>

    </array>
</dict>
</plist>
