<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
 <key>Comment</key>
 <string>Created with Christoph Keller</string>
 <key>Description</key>
 <string>Downloads the latest version of ZaxConvert.</string>
 <key>Identifier</key>
 <string>com.github.srgssr.download.ZaxConvert</string>
 <key>Input</key>
 <dict>
  <key>NAME</key>
  <string>ZaxConvert</string>
 </dict>
 <key>MinimumVersion</key>
 <string>1.0.0</string>
 <key>Process</key>
 <array>
<dict>
  <key>Processor</key>
  <string>URLTextSearcher</string>
  <key>Arguments</key>
  <dict>
    <key>url</key>
    <string>https://zaxcom.com/product/zaxconvert/</string>
    <key>re_pattern</key>
    <string>https:\/\/zaxcom\.com\/wp-content\/uploads\/\d{4}\/\d{2}\/Zaxconvert_[\d.]+_PC_MAC\.zip</string>
    <key>result_output_var_name</key>
    <string>url</string>
  </dict>
</dict>
<!-- Downbload -->
  <dict>
   <key>Processor</key>
   <string>URLDownloader</string>
   <key>Arguments</key>
   <dict>
    <key>url</key>
    <string>%url%</string>
    <key>filename</key>
    <string>%NAME%.zip</string>
   </dict>
  </dict>

<!-- Version aus derselben Produktseite extrahieren -->
<dict>
  <key>Processor</key>
  <string>URLTextSearcher</string>
  <key>Arguments</key>
  <dict>
    <key>url</key>
    <string>https://zaxcom.com/product/zaxconvert/</string>
    <key>re_pattern</key>
    <!-- <string>Zaxconvert_([\d.]+)_PC_MAC\.zip</string> -->
    <string>https:\/\/zaxcom\.com\/wp-content\/uploads\/\d{4}\/\d{2}\/Zaxconvert_([\d.]+)_PC_MAC\.zip</string>
    <key>result_output_var_name</key>
    <string>version</string>
    <key>encoding</key>
    <string>latin-1</string>
  </dict>
</dict>
            <dict>
   <key>Processor</key>
   <string>EndOfCheckPhase</string>
      </dict>
            <!-- Unarchive zip -->
    <dict>
        <key>Processor</key>
        <string>Unarchiver</string>
        <key>Arguments</key>
        <dict>
            <key>archive_path</key>
            <string>%pathname%</string>
            <key>destination_path</key>
            <string>%RECIPE_CACHE_DIR%/unpack</string>
        </dict>
    </dict>
            <!-- Find inner zip -->
    <dict>
        <key>Processor</key>
        <string>FileFinder</string>
        <key>Arguments</key>
        <dict>
            <key>pattern</key>
            <string>%RECIPE_CACHE_DIR%/unpack/*/ZaxConvert-*-MAC.zip</string>
        </dict>
    </dict>

    <!-- Unarchive inner zip -->
    <dict>
        <key>Processor</key>
        <string>Unarchiver</string>
        <key>Arguments</key>
        <dict>
            <key>archive_path</key>
            <string>%found_filename%</string>
            <key>destination_path</key>
            <string>%RECIPE_CACHE_DIR%/source</string>
        </dict>
    </dict>

    <!-- Find the .dmg file -->
    <dict>
        <key>Processor</key>
        <string>FileFinder</string>
        <key>Arguments</key>
        <dict>
            <key>pattern</key>
            <string>%RECIPE_CACHE_DIR%/unpack/*/lame-*.dmg</string>
        </dict>
    </dict>

    <!-- Copy .dmg to source directory -->
    <dict>
        <key>Processor</key>
        <string>Copier</string>
        <key>Arguments</key>
        <dict>
            <key>source_path</key>
            <string>%found_filename%</string>
            <key>destination_path</key>
            <string>%RECIPE_CACHE_DIR%/source/lame.dmg</string>
        </dict>
    </dict>
 <!-- CleanUp -->
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/unpack</string>
                </array>
            </dict>
            </dict>
            <!-- Take PKG out of DMG -->
        <dict>
        <key>Processor</key>
        <string>PkgCopier</string>
        <key>Arguments</key>
        <dict>
            <key>source_pkg</key>
            <string>%RECIPE_CACHE_DIR%/source/lame.dmg/*.pkg</string>
            <key>pkg_path</key>
            <string>%RECIPE_CACHE_DIR%/source/lame.pkg</string>
        </dict>
    </dict>
    <!--CodeSignatureVerifier doesnt work looks like it not really signed-->
    </array>
</dict>
</plist>