<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads MemoryMediaUtility</string>
	<key>Identifier</key>
	<string>com.github.srgssr.download.MemoryMediaUtility</string>
	<key>MinimumVersion</key>
	<string>0.6.0</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>MemoryMediaUtility</string>
		<key>URL</key>
		<string>https://www.sony.ch/de/electronics/support/results?query=memory+media+utility+mac</string>
	</dict>
	<key>Process</key>
	<array>
 		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%URL%</string>
				<key>result_output_var_name</key>
				<string>id</string>
				<key>re_pattern</key>
				<string>(?&lt;=electronics\/support\/software\/)(\d+)(?=.*\bMac\b)</string>
				<key>request_headers</key>
				<dict>
					<key>user-agent</key>
					<string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/17.4.1 Safari/605.1.15</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://www.sony.ch/de/electronics/support/software/%id%</string>
				<key>result_output_var_name</key>
				<string>download_url_with_backslashes</string>
				<key>re_pattern</key>
				<string>(https:\\/\\/download\.pro\.sony.*_mac\.zip)</string>
				<key>request_headers</key>
				<dict>
					<key>user-agent</key>
					<string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/17.4.1 Safari/605.1.15</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.homebysix.FindAndReplace/FindAndReplace</string>
			<key>Arguments</key>
			<dict>
				<key>input_string</key>
				<string>%download_url_with_backslashes%</string>
				<key>find</key>
				<string>\</string>
				<key>replace</key>
				<string></string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%output_string%</string>
				<key>filename</key>
				<string>%NAME%.zip</string>
			</dict>			
		</dict>
	</array>
</dict>
</plist>
