<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Sony SxS Device Driver and imports it into Munki.</string>
	<key>Comment</key>
	<string>20230615: Modified by Jens Junge for Version 5.0.0</string>
	<key>Identifier</key>
	<string>com.github.srgssr.munki.SxSDeviceDriver</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>Sony/SxSDeviceDriver</string>
		<key>NAME</key>
		<string>SxSDeviceDriver</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>This SxS Driver is required for SBAC-T40 SxS Memory Card Thunderbolt 3 Card Reader/Writer to connect Windows PC or Mac.</string>
			<key>developer</key>
			<string>Sony</string>
			<key>display_name</key>
			<string>Sony SxS Device Driver</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>category</key>
			<string>Driver</string>
			<key>unattended_install</key>
			<true/>
			<key>minosversion</key>
			<string>12.4</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.srgssr.download.SxSDeviceDriver</string>
	<key>Process</key>
	<array>
		<!-- create installs section -->
<!--		<dict>
			<key>Comment</key>
			<string>Copy kext into installs structure </string>
			<key>Processor</key>
			 <string>Copier</string>
			 <key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/payload-Apple/SxS Memory Card.kext</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/root/Library/Extensions/SxS Memory Card.kext</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiInstallsItemsCreator</string>
			<key>Arguments</key>
			<dict>
				<key>faux_root</key>
				<string>%RECIPE_CACHE_DIR%/root</string>
				<key>installs_item_paths</key>
				<array>
					<string>/Library/Extensions/SxS Memory Card.kext</string>
				</array>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
-->
		<!-- import into Munki Repo -->
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/unzip/%NAME%.dmg</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
		<!-- clean up -->
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/unzip</string>
					<!--
					<string>%RECIPE_CACHE_DIR%/root</string>
					-->
					<string>%RECIPE_CACHE_DIR%/payload-Apple</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
