<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
  <string>Downloads Sony SxS Device Driver</string>
  <key>Identifier</key>
  <string>com.github.srgssr.download.SxSDeviceDriver</string>
  <key>MinimumVersion</key>
  <string>0.6.0</string>
  <key>Input</key>
  <dict>
      <key>NAME</key>
      <string>SxSDeviceDriver</string>
      <key>URL</key>
      <string>https://www.sonycreativesoftware.com/de/sxsdriver</string>
  </dict>
  <key>Process</key>
  <array>
	<!-- get file from website -->
    <dict>
      <key>Processor</key>
      <string>URLTextSearcher</string>
      <key>Arguments</key>
      <dict>
          <key>url</key>
          <string>%URL%</string>
          <key>result_output_var_name</key>
          <string>id</string>
          <key>re_pattern</key>
          <string>&lt;option[^&gt;]+?value="([^"]+)".*macOS</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>URLTextSearcher</string>
      <key>Arguments</key>
      <dict>
          <key>url</key>
          <string>%URL%</string>
          <key>result_output_var_name</key>
          <string>download_url</string>
          <key>re_pattern</key>
          <string>&lt;a[^&gt;]+?id=".*%id%".*href="([^"]+)"</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>URLDownloader</string>
      <key>Arguments</key>
      <dict>
          <key>url</key>
          <string>https://www.sonycreativesoftware.com%download_url%</string>
          <key>filename</key>
          <string>%NAME%.zip</string> 
      </dict>
    </dict>
		<!-- unpzip downloades file  -->
		<dict>
            <key>Comment</key>
            <string>Get PKG from the ZIP file</string>
            <key>Processor</key>
            <string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unzip</string>
			</dict>
        </dict>
		<!-- unpack flat pkg and all payloads -->
		<dict>
            <key>Comment</key>
            <string>Get the path and filename of the PKG</string>
			<key>Processor</key>
            <string>FileFinder</string>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/unzip/*.dmg</string>
			</dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Unpack flat PKG to unpack folder</string>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>skip_payload</key>
                <false/>
                <key>flat_pkg_path</key>
                <string>%found_filename%/SxS Device Driver Installer v*.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
            </dict>
        </dict>
         <dict>
            <key>Comment</key>
            <string>Unpack sxsMemoryCard110.pkg Payload</string>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/sxsMemoryCard110.pkg/Payload</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/payload-Intel/</string>
            </dict>
        </dict>
         <dict>
            <key>Comment</key>
            <string>Unpack sxsMemoryCard.pkg Payload</string>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/sxsMemoryCard.pkg/Payload</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/payload-Apple/</string>
            </dict>
        </dict>
		<!-- verify code signatures -->
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/payload-Intel/SxS Memory Card.kext</string>
                <key>deep_verification</key>
                <true/>
                <key>strict_verification</key>
                <true/>
                <key>requirement</key>
                <string>identifier "com.sony.pci.SxS" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = VH49J2FYHE</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/payload-Apple/SxS Memory Card.kext</string>
                <key>deep_verification</key>
                <true/>
                <key>strict_verification</key>
                <true/>
                <key>requirement</key>
                <string>identifier "com.sony.pci.SxS" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = VH49J2FYHE</string>
            </dict>
        </dict>
		<!-- clean up -->
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/unpack</string>
                    <string>%RECIPE_CACHE_DIR%/payload-Intel</string>
                </array>
            </dict>
        </dict>
  </array>
</dict>
</plist>
