<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>20240415: Modified by Michael Schuler for Version 5.10</string>
	<key>Description</key>
	<string>Downloads Version 5.10 of SxS UDF Driver.</string>
	<key>Identifier</key>
	<string>com.github.srgssr.download.SxSUDFDriver</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>SxSUDFDriver</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
					<key>url</key>
					<string>https://download.pro.sony/24/04/xDNNBs130F/SxSUDFDriver_5_1_0_mac.zip</string>
					<key>filename</key>
					<string>%NAME%.zip</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>purge_destination</key>
				<true/>
			</dict>
		</dict>
		<dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
               <key>pattern</key>
               <string>%RECIPE_CACHE_DIR%/%NAME%/*.dmg</string>
            </dict>
         </dict>
          <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
               <key>source_path</key>
               <string>%found_filename%</string>
			   <key>destination_path</key>
               <string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.dmg</string>
			   <key>overwrite</key>
				<true/>
            </dict>
         </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Sony Corporation (VH49J2FYHE)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.dmg/*.pkg</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
