<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads XDCAMDriveSoftware.</string>
	<key>Identifier</key>
	<string>com.github.srgssr.download.XDCAMDriveSoftware</string>
	<key>MinimumVersion</key>
	<string>0.6.0</string>
	<key>Input</key>
	<dict>
			<key>NAME</key>
			<string>XDCAMDriveSoftware</string>
	</dict>
  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>URLTextSearcher</string>
      <key>Arguments</key>
      <dict>
          <key>url</key>
          <string>https://www.sony.ch/de/electronics/support/software/00368584</string>
          <key>result_output_var_name</key>
          <string>download_url_with_backslashes</string>
          <key>re_pattern</key>
          <string>(https:\\/\\/download\.pro\.sony.*_mac\.zip)</string>
          <key>request_headers</key>
    		<dict>
      			<key>user-agent</key>
				<string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/17.4.1 Safari/605.1.15</string>
    		</dict>
      </dict>
    </dict>
    <dict>
    <key>Arguments</key>
    <dict>
        <key>find</key>
        <string>\</string>
        <key>input_string</key>
        <string>%download_url_with_backslashes%</string>
        <key>replace</key>
        <string></string>
    </dict>
    <key>Processor</key>
    <string>com.github.homebysix.FindAndReplace/FindAndReplace</string>
</dict>
    <dict>
      <key>Processor</key>
      <string>URLDownloader</string>
      <key>Arguments</key>
      <dict>
          <key>url</key>
          <string>%output_string%</string>
          <key>filename</key>
          <string>%NAME%.zip</string>
      </dict>      
    </dict>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>purge_destination</key>
				<true/>
			</dict>
		</dict>
		<!-- find DMG in unpacked structure and rename for further processors-->
		<dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
               <key>pattern</key>
               <string>%RECIPE_CACHE_DIR%/%NAME%/*.dmg</string>
            </dict>
         </dict>
		 <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
               <key>source_path</key>
               <string>%found_filename%</string>
			   <key>destination_path</key>
               <string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.dmg</string>
			   <key>overwrite</key>
				<true/>
            </dict>
         </dict>
		 <!-- unpack PKG inside DMG containing three Payloads -->
		<dict>
			<key>Comment</key>
			<string>Unpack flat pkg inside dmg to unpack folder.</string>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>flat_pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.dmg/XDCAM Drive Software.pkg</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/Base_Components.pkg/Payload</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload</string>
				<key>purge_destination</key>
				<false/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/syncXD.pkg/Payload</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload</string>
				<key>purge_destination</key>
				<false/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/XDM_SetupHelper.pkg/Payload</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload</string>
				<key>purge_destination</key>
				<false/>
			</dict>
		</dict>
		<!-- Verify code signatures -->
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/Applications/XDCAM Drive/XDCAM Drive Monitor.app</string>
				<key>requirement</key>
				<string>identifier "com.sony.vfam.monitor" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = VH49J2FYHE</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/Applications/XDCAM Drive/XDCAM Drive Utility.app</string>
				<key>requirement</key>
				<string>identifier "com.sony.PCUtility" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = VH49J2FYHE</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/Library/Application Support/XDCAM Drive/xdcamMntHelper.app</string>
				<key>requirement</key>
				<string>identifier "com.sips.xdcamMntHelper" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = VH49J2FYHE</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/Library/PreferencePanes/XDCAM Drive Monitor.prefPane</string>
				<key>requirement</key>
				<string>identifier "com.sony.vfam.monitorPref" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = VH49J2FYHE</string>
			</dict>
		</dict>
		<!-- clean up -->
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
					<string>%RECIPE_CACHE_DIR%/payload</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
