<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of XDCAMDriveSoftware and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.srgssr.munki.XDCAMDriveSoftware</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>Sony/XDCAMDriveSoftware</string>
		<key>NAME</key>
		<string>XDCAMDriveSoftware</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>XDCAM Drive Software ist ein Basisdienstprogramm, mit dem Benutzer Dateien auf einem Computer, der mit einem PDW-U1/U2 Professional Disc-Laufwerk verbunden ist, lesen/schreiben können.</string>
			<key>developer</key>
			<string>Sony</string>
			<key>display_name</key>
			<string>XDCAM Drive Software</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>category</key>
			<string>Tools</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.srgssr.download.XDCAMDriveSoftware</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.dmg</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>

