<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads XDCAMDriveSoftware.</string>
	<key>Identifier</key>
	<string>com.github.srgssr.download.XDCAMDriveSoftware</string>
	<key>MinimumVersion</key>
	<string>0.6.0</string>
	<key>Input</key>
	<dict>
			<key>NAME</key>
			<string>XDCAMDriveSoftware</string>
			<key>URL</key>
			<string>https://www.sonycreativesoftware.com/de/download/xdcamdrive</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
					<key>url</key>
					<string>%URL%</string>
					<key>result_output_var_name</key>
					<string>id</string>
					<key>re_pattern</key>
					<string>&lt;option[^&gt;]+?value="([^"]+)".*macOS</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
					<key>url</key>
					<string>%URL%</string>
					<key>result_output_var_name</key>
					<string>download_url</string>
					<key>re_pattern</key>
					<string>&lt;a[^&gt;]+?id=".*%id%".*href="([^"]+)"</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
					<key>url</key>
					<string>https://www.sonycreativesoftware.com%download_url%</string>
					<key>filename</key>
					<string>%NAME%.zip</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>purge_destination</key>
				<true/>
			</dict>
		</dict>
		<!-- unpack PKG inside DMG containing three Payloads -->
		<dict>
			<key>Comment</key>
			<string>Unpack flat pkg inside dmg to unpack folder.</string>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>flat_pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.dmg/XDCAM Drive Software.pkg</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/Base_Components.pkg/Payload</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload</string>
				<key>purge_destination</key>
				<false/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/syncXD.pkg/Payload</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload</string>
				<key>purge_destination</key>
				<false/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/XDM_SetupHelper.pkg/Payload</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload</string>
				<key>purge_destination</key>
				<false/>
			</dict>
		</dict>
		<!-- Verify code signatures -->
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/Applications/XDCAM Drive/XDCAM Drive Monitor.app</string>
				<key>requirement</key>
				<string>identifier "com.sony.vfam.monitor" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = EKS2CRZPNK</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/Applications/XDCAM Drive/XDCAM Drive Utility.app</string>
				<key>requirement</key>
				<string>identifier "com.sony.PCUtility" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = EKS2CRZPNK</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/Library/Application Support/XDCAM Drive/xdcamMntHelper.app</string>
				<key>requirement</key>
				<string>identifier "com.sips.xdcamMntHelper" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = EKS2CRZPNK</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/Library/PreferencePanes/XDCAM Drive Monitor.prefPane</string>
				<key>requirement</key>
				<string>identifier "com.sony.vfam.monitorPref" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = EKS2CRZPNK</string>
			</dict>
		</dict>
		<!-- clean up -->
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
					<string>%RECIPE_CACHE_DIR%/payload</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
