<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Puts the installer in a package in /private/tmp that can be installed by postinstall script later.</string>
	<key>Identifier</key>
	<string>com.github.srgssr.pkg.ColorNavigator7</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>ColorNavigator7</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.srgssr.download.ColorNavigator7</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                <key>pkgdirs</key>
                <dict>
                    <key>private</key>
                    <string>0755</string>
                    <key>private/tmp</key>
                    <string>1777</string>
                </dict>

            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/private/tmp</string>
				<key>source_path</key>
				<string>%pathname%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Versioner</string>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/Applications/ColorNavigator 7.app/Contents/Info.plist</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
					<key>pkgdir</key>
					<string>%RECIPE_CACHE_DIR%</string>
					<key>pkgname</key>
					<string>ColorNavigator7-%version%</string>
					<key>version</key>
					<string>%version%</string>
					<key>id</key>
					<string>com.srgssr.pkg.ColorNavigator7</string>
					<key>options</key>
					<string>purge_ds_store</string>
					<key>chown</key>
					<array>
						<dict>
							<key>path</key>
							<string>private</string>
							<key>user</key>
							<string>root</string>
							<key>group</key>
							<string>wheel</string>
							<key>mode</key>
							<string>755</string>
						</dict>
						<dict>
							<key>path</key>
							<string>private/tmp</string>
							<key>user</key>
							<string>root</string>
							<key>group</key>
							<string>wheel</string>
							<key>mode</key>
							<string>1777</string>
						</dict>
					</array>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
