<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Imports Rive into Munki</string>
	<key>Identifier</key>
	<string>com.github.srgssr.munki.rive</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>https://releases.rive.app/macos/latest/Rive.dmg</string>
		<key>NAME</key>
		<string>Rive</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/Rive Inc/%NAME%</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Creative 3D</string>
			<key>description</key>
			<string>Rive is a real-time animation and design tool for creating interactive graphics across web, mobile, and game platforms. It combines a vector editor with a powerful state machine to enable dynamic animations. The platform supports various frameworks and offers both no-code and developer-friendly integrations.</string>
			<key>developer</key>
			<string>Rive Inc</string>
			<key>display_name</key>
			<string>Rive</string>
			<key>minimum_os_version</key>
			<string>10.10</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MiniumumVersion</key>
	<string>1.0</string>
	<key>ParentRecipe</key>
	<string>com.github.srgssr.download.rive</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
